name: "video-embedder"
platform: "pytorch_libtorch"
max_batch_size: 4

input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ -1, 32, 3, 256, 256 ]
  },
  {
    name: "input__1"
    data_type: TYPE_FP32
    dims: [ -1, 8, 3, 256, 256 ]
  }
]

output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ -1, 400 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 4 ]
}

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]
